finans.УчётИнвестиций/src/Documents/Инвест_ОткрытиеВклада/Инвест_ОткрытиеВклада.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Инвест_ОткрытиеВклада</name>
  <registerRecords>AccumulationRegister.Инвест_Вклады</registerRecords>
  <attributes>
    <name>Банк</name>
    <type>
      <types>CatalogRef.Инвест_Банки</types>
    </type>
  </attributes>
  <attributes>
    <name>Вклад</name>
    <type>
      <types>CatalogRef.Инвест_Вклады</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Document>

finans.УчётИнвестиций/src/AccumulationRegisters/Инвест_Вклады/Инвест_Вклады.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Инвест_Вклады</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Вклад</name>
    <type>
      <types>CatalogRef.Инвест_Вклады</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

finans.УчётИнвестиций/src/Documents/Инвест_ОткрытиеВклада/ObjectModule.bsl
// переименовать
#Область Процедуры_Проведения

Процедура ОбработкаПроведения(Отказ, Режим)

	// регистр Инвест_Вклады
	Движения.Инвест_Вклады.Записывать = Истина;
	Движение = Движения.Инвест_Вклады.Добавить();
	Движение.Период = Дата;
	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	Движение.Вклад = Вклад;
	Движение.Сумма = Сумма;

КонецПроцедуры

#КонецОбласти
